; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_1)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 link10 link11 - link
    angle0 angle30 angle60 angle90 angle120 angle150 angle180 angle210 angle240 angle270 angle300 angle330 - angle)
(:init
    (AngleOrd angle0 angle30)
    (AngleOrd angle30 angle60)
    (AngleOrd angle60 angle90)
    (AngleOrd angle90 angle120)
    (AngleOrd angle120 angle150)
    (AngleOrd angle150 angle180)
    (AngleOrd angle180 angle210)
    (AngleOrd angle210 angle240)
    (AngleOrd angle240 angle270)
    (AngleOrd angle270 angle300)
    (AngleOrd angle300 angle330)
    (AngleOrd angle330 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)
    (IsChildOf link10 link9)
    (IsChildOf link11 link10)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)
    (Affected link9 link1)
    (Affected link9 link2)
    (Affected link9 link3)
    (Affected link9 link4)
    (Affected link9 link5)
    (Affected link9 link6)
    (Affected link9 link7)
    (Affected link9 link8)
    (Affected link10 link1)
    (Affected link10 link2)
    (Affected link10 link3)
    (Affected link10 link4)
    (Affected link10 link5)
    (Affected link10 link6)
    (Affected link10 link7)
    (Affected link10 link8)
    (Affected link10 link9)
    (Affected link11 link1)
    (Affected link11 link2)
    (Affected link11 link3)
    (Affected link11 link4)
    (Affected link11 link5)
    (Affected link11 link6)
    (Affected link11 link7)
    (Affected link11 link8)
    (Affected link11 link9)
    (Affected link11 link10)

    (HasAngle angle180 link1)
    (HasAngle angle270 link2)
    (HasAngle angle330 link3)
    (HasAngle angle300 link4)
    (HasAngle angle0 link5)
    (HasAngle angle30 link6)
    (HasAngle angle30 link7)
    (HasAngle angle270 link8)
    (HasAngle angle240 link9)
    (HasAngle angle0 link10)
    (HasAngle angle120 link11)
)
(:goal
(and
    (HasAngle angle150 link1)
    (HasAngle angle300 link2)
    (HasAngle angle0 link3)
    (HasAngle angle210 link4)
    (HasAngle angle270 link5)
    (HasAngle angle210 link6)
    (HasAngle angle30 link7)
    (HasAngle angle330 link8)
    (HasAngle angle60 link9)
    (HasAngle angle270 link10)
    (HasAngle angle150 link11)
    )
)
)

; plan
1. (decrease_angle link1 angle180 angle150)
   deleted: (hasangle angle180 link1) (hasangle angle270 link2) (hasangle angle330 link3) (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle30 link6) (hasangle angle30 link7) (hasangle angle270 link8) (hasangle angle240 link9) (hasangle angle0 link10) (hasangle angle120 link11)
   added: (hasangle angle150 link1) (hasangle angle240 link2) (hasangle angle300 link3) (hasangle angle270 link4) (hasangle angle330 link5) (hasangle angle0 link6) (hasangle angle0 link7) (hasangle angle240 link8) (hasangle angle210 link9) (hasangle angle330 link10) (hasangle angle90 link11)
   goals met: 1 of 11
2. (increase_angle link2 angle240 angle270)
   deleted: (hasangle angle240 link2) (hasangle angle300 link3) (hasangle angle270 link4) (hasangle angle330 link5) (hasangle angle0 link6) (hasangle angle0 link7) (hasangle angle240 link8) (hasangle angle210 link9) (hasangle angle330 link10) (hasangle angle90 link11)
   added: (hasangle angle270 link2) (hasangle angle330 link3) (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle30 link6) (hasangle angle30 link7) (hasangle angle270 link8) (hasangle angle240 link9) (hasangle angle0 link10) (hasangle angle120 link11)
   goals met: 2 of 11
3. (increase_angle link2 angle270 angle300)
   deleted: (hasangle angle270 link2) (hasangle angle330 link3) (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle30 link6) (hasangle angle30 link7) (hasangle angle270 link8) (hasangle angle240 link9) (hasangle angle0 link10) (hasangle angle120 link11)
   added: (hasangle angle300 link2) (hasangle angle0 link3) (hasangle angle330 link4) (hasangle angle30 link5) (hasangle angle60 link6) (hasangle angle60 link7) (hasangle angle300 link8) (hasangle angle270 link9) (hasangle angle30 link10) (hasangle angle150 link11)
   goals met: 4 of 11
4. (decrease_angle link4 angle330 angle300)
   deleted: (hasangle angle330 link4) (hasangle angle30 link5) (hasangle angle60 link6) (hasangle angle60 link7) (hasangle angle300 link8) (hasangle angle270 link9) (hasangle angle30 link10) (hasangle angle150 link11)
   added: (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle30 link6) (hasangle angle30 link7) (hasangle angle270 link8) (hasangle angle240 link9) (hasangle angle0 link10) (hasangle angle120 link11)
   goals met: 4 of 11
5. (decrease_angle link4 angle300 angle270)
   deleted: (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle30 link6) (hasangle angle30 link7) (hasangle angle270 link8) (hasangle angle240 link9) (hasangle angle0 link10) (hasangle angle120 link11)
   added: (hasangle angle270 link4) (hasangle angle330 link5) (hasangle angle0 link6) (hasangle angle0 link7) (hasangle angle240 link8) (hasangle angle210 link9) (hasangle angle330 link10) (hasangle angle90 link11)
   goals met: 3 of 11
6. (decrease_angle link4 angle270 angle240)
   deleted: (hasangle angle270 link4) (hasangle angle330 link5) (hasangle angle0 link6) (hasangle angle0 link7) (hasangle angle240 link8) (hasangle angle210 link9) (hasangle angle330 link10) (hasangle angle90 link11)
   added: (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle330 link6) (hasangle angle330 link7) (hasangle angle210 link8) (hasangle angle180 link9) (hasangle angle300 link10) (hasangle angle60 link11)
   goals met: 3 of 11
7. (increase_angle link2 angle300 angle330)
   deleted: (hasangle angle300 link2) (hasangle angle0 link3) (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle330 link6) (hasangle angle330 link7) (hasangle angle210 link8) (hasangle angle180 link9) (hasangle angle300 link10) (hasangle angle60 link11)
   added: (hasangle angle330 link2) (hasangle angle30 link3) (hasangle angle270 link4) (hasangle angle330 link5) (hasangle angle0 link6) (hasangle angle0 link7) (hasangle angle240 link8) (hasangle angle210 link9) (hasangle angle330 link10) (hasangle angle90 link11)
   goals met: 1 of 11
8. (decrease_angle link10 angle330 angle300)
   deleted: (hasangle angle330 link10) (hasangle angle90 link11)
   added: (hasangle angle300 link10) (hasangle angle60 link11)
   goals met: 1 of 11
9. (increase_angle link3 angle30 angle60)
   deleted: (hasangle angle30 link3) (hasangle angle270 link4) (hasangle angle330 link5) (hasangle angle0 link6) (hasangle angle0 link7) (hasangle angle240 link8) (hasangle angle210 link9) (hasangle angle300 link10) (hasangle angle60 link11)
   added: (hasangle angle60 link3) (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle30 link6) (hasangle angle30 link7) (hasangle angle270 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle90 link11)
   goals met: 2 of 11
10. (decrease_angle link2 angle330 angle300)
   deleted: (hasangle angle330 link2) (hasangle angle60 link3) (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle30 link6) (hasangle angle30 link7) (hasangle angle270 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle90 link11)
   added: (hasangle angle300 link2) (hasangle angle30 link3) (hasangle angle270 link4) (hasangle angle330 link5) (hasangle angle0 link6) (hasangle angle0 link7) (hasangle angle240 link8) (hasangle angle210 link9) (hasangle angle300 link10) (hasangle angle60 link11)
   goals met: 2 of 11
11. (increase_angle link8 angle240 angle270)
   deleted: (hasangle angle240 link8) (hasangle angle210 link9) (hasangle angle300 link10) (hasangle angle60 link11)
   added: (hasangle angle270 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle90 link11)
   goals met: 2 of 11
12. (increase_angle link11 angle90 angle120)
   deleted: (hasangle angle90 link11)
   added: (hasangle angle120 link11)
   goals met: 2 of 11
13. (decrease_angle link9 angle240 angle210)
   deleted: (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle120 link11)
   added: (hasangle angle210 link9) (hasangle angle300 link10) (hasangle angle90 link11)
   goals met: 2 of 11
14. (increase_angle link11 angle90 angle120)
   deleted: (hasangle angle90 link11)
   added: (hasangle angle120 link11)
   goals met: 2 of 11
15. (increase_angle link8 angle270 angle300)
   deleted: (hasangle angle270 link8) (hasangle angle210 link9) (hasangle angle300 link10) (hasangle angle120 link11)
   added: (hasangle angle300 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle150 link11)
   goals met: 3 of 11
16. (decrease_angle link9 angle240 angle210)
   deleted: (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle150 link11)
   added: (hasangle angle210 link9) (hasangle angle300 link10) (hasangle angle120 link11)
   goals met: 2 of 11
17. (increase_angle link10 angle300 angle330)
   deleted: (hasangle angle300 link10) (hasangle angle120 link11)
   added: (hasangle angle330 link10) (hasangle angle150 link11)
   goals met: 3 of 11
18. (increase_angle link11 angle150 angle180)
   deleted: (hasangle angle150 link11)
   added: (hasangle angle180 link11)
   goals met: 2 of 11
19. (decrease_angle link9 angle210 angle180)
   deleted: (hasangle angle210 link9) (hasangle angle330 link10) (hasangle angle180 link11)
   added: (hasangle angle180 link9) (hasangle angle300 link10) (hasangle angle150 link11)
   goals met: 3 of 11
20. (decrease_angle link9 angle180 angle150)
   deleted: (hasangle angle180 link9) (hasangle angle300 link10) (hasangle angle150 link11)
   added: (hasangle angle150 link9) (hasangle angle270 link10) (hasangle angle120 link11)
   goals met: 3 of 11
21. (increase_angle link8 angle300 angle330)
   deleted: (hasangle angle300 link8) (hasangle angle150 link9) (hasangle angle270 link10) (hasangle angle120 link11)
   added: (hasangle angle330 link8) (hasangle angle180 link9) (hasangle angle300 link10) (hasangle angle150 link11)
   goals met: 4 of 11
22. (decrease_angle link4 angle270 angle240)
   deleted: (hasangle angle270 link4) (hasangle angle330 link5) (hasangle angle0 link6) (hasangle angle0 link7) (hasangle angle330 link8) (hasangle angle180 link9) (hasangle angle300 link10) (hasangle angle150 link11)
   added: (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle330 link6) (hasangle angle330 link7) (hasangle angle300 link8) (hasangle angle150 link9) (hasangle angle270 link10) (hasangle angle120 link11)
   goals met: 3 of 11
23. (increase_angle link7 angle330 angle0)
   deleted: (hasangle angle330 link7) (hasangle angle300 link8) (hasangle angle150 link9) (hasangle angle270 link10) (hasangle angle120 link11)
   added: (hasangle angle0 link7) (hasangle angle330 link8) (hasangle angle180 link9) (hasangle angle300 link10) (hasangle angle150 link11)
   goals met: 4 of 11
24. (decrease_angle link4 angle240 angle210)
   deleted: (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle330 link6) (hasangle angle0 link7) (hasangle angle330 link8) (hasangle angle180 link9) (hasangle angle300 link10) (hasangle angle150 link11)
   added: (hasangle angle210 link4) (hasangle angle270 link5) (hasangle angle300 link6) (hasangle angle330 link7) (hasangle angle300 link8) (hasangle angle150 link9) (hasangle angle270 link10) (hasangle angle120 link11)
   goals met: 5 of 11
25. (increase_angle link7 angle330 angle0)
   deleted: (hasangle angle330 link7) (hasangle angle300 link8) (hasangle angle150 link9) (hasangle angle270 link10) (hasangle angle120 link11)
   added: (hasangle angle0 link7) (hasangle angle330 link8) (hasangle angle180 link9) (hasangle angle300 link10) (hasangle angle150 link11)
   goals met: 6 of 11
26. (increase_angle link11 angle150 angle180)
   deleted: (hasangle angle150 link11)
   added: (hasangle angle180 link11)
   goals met: 5 of 11
27. (decrease_angle link8 angle330 angle300)
   deleted: (hasangle angle330 link8) (hasangle angle180 link9) (hasangle angle300 link10) (hasangle angle180 link11)
   added: (hasangle angle300 link8) (hasangle angle150 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   goals met: 6 of 11
28. (increase_angle link10 angle270 angle300)
   deleted: (hasangle angle270 link10) (hasangle angle150 link11)
   added: (hasangle angle300 link10) (hasangle angle180 link11)
   goals met: 4 of 11
29. (decrease_angle link9 angle150 angle120)
   deleted: (hasangle angle150 link9) (hasangle angle300 link10) (hasangle angle180 link11)
   added: (hasangle angle120 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   goals met: 6 of 11
30. (increase_angle link8 angle300 angle330)
   deleted: (hasangle angle300 link8) (hasangle angle120 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   added: (hasangle angle330 link8) (hasangle angle150 link9) (hasangle angle300 link10) (hasangle angle180 link11)
   goals met: 5 of 11
31. (decrease_angle link6 angle300 angle270)
   deleted: (hasangle angle300 link6) (hasangle angle0 link7) (hasangle angle330 link8) (hasangle angle150 link9) (hasangle angle300 link10) (hasangle angle180 link11)
   added: (hasangle angle270 link6) (hasangle angle330 link7) (hasangle angle300 link8) (hasangle angle120 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   goals met: 6 of 11
32. (decrease_angle link9 angle120 angle90)
   deleted: (hasangle angle120 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   added: (hasangle angle90 link9) (hasangle angle240 link10) (hasangle angle120 link11)
   goals met: 4 of 11
33. (increase_angle link7 angle330 angle0)
   deleted: (hasangle angle330 link7) (hasangle angle300 link8) (hasangle angle90 link9) (hasangle angle240 link10) (hasangle angle120 link11)
   added: (hasangle angle0 link7) (hasangle angle330 link8) (hasangle angle120 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   goals met: 7 of 11
34. (decrease_angle link9 angle120 angle90)
   deleted: (hasangle angle120 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   added: (hasangle angle90 link9) (hasangle angle240 link10) (hasangle angle120 link11)
   goals met: 5 of 11
35. (increase_angle link10 angle240 angle270)
   deleted: (hasangle angle240 link10) (hasangle angle120 link11)
   added: (hasangle angle270 link10) (hasangle angle150 link11)
   goals met: 7 of 11
36. (decrease_angle link8 angle330 angle300)
   deleted: (hasangle angle330 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   added: (hasangle angle300 link8) (hasangle angle60 link9) (hasangle angle240 link10) (hasangle angle120 link11)
   goals met: 5 of 11
37. (increase_angle link7 angle0 angle30)
   deleted: (hasangle angle0 link7) (hasangle angle300 link8) (hasangle angle60 link9) (hasangle angle240 link10) (hasangle angle120 link11)
   added: (hasangle angle30 link7) (hasangle angle330 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   goals met: 8 of 11
38. (increase_angle link7 angle30 angle60)
   deleted: (hasangle angle30 link7) (hasangle angle330 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   added: (hasangle angle60 link7) (hasangle angle0 link8) (hasangle angle120 link9) (hasangle angle300 link10) (hasangle angle180 link11)
   goals met: 4 of 11
39. (decrease_angle link6 angle270 angle240)
   deleted: (hasangle angle270 link6) (hasangle angle60 link7) (hasangle angle0 link8) (hasangle angle120 link9) (hasangle angle300 link10) (hasangle angle180 link11)
   added: (hasangle angle240 link6) (hasangle angle30 link7) (hasangle angle330 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   goals met: 8 of 11
40. (increase_angle link7 angle30 angle60)
   deleted: (hasangle angle30 link7) (hasangle angle330 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   added: (hasangle angle60 link7) (hasangle angle0 link8) (hasangle angle120 link9) (hasangle angle300 link10) (hasangle angle180 link11)
   goals met: 4 of 11
41. (decrease_angle link9 angle120 angle90)
   deleted: (hasangle angle120 link9) (hasangle angle300 link10) (hasangle angle180 link11)
   added: (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   goals met: 6 of 11
42. (increase_angle link10 angle270 angle300)
   deleted: (hasangle angle270 link10) (hasangle angle150 link11)
   added: (hasangle angle300 link10) (hasangle angle180 link11)
   goals met: 4 of 11
43. (decrease_angle link3 angle30 angle0)
   deleted: (hasangle angle30 link3) (hasangle angle210 link4) (hasangle angle270 link5) (hasangle angle240 link6) (hasangle angle60 link7) (hasangle angle0 link8) (hasangle angle90 link9) (hasangle angle300 link10) (hasangle angle180 link11)
   added: (hasangle angle0 link3) (hasangle angle180 link4) (hasangle angle240 link5) (hasangle angle210 link6) (hasangle angle30 link7) (hasangle angle330 link8) (hasangle angle60 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   goals met: 9 of 11
44. (increase_angle link4 angle180 angle210)
   deleted: (hasangle angle180 link4) (hasangle angle240 link5) (hasangle angle210 link6) (hasangle angle30 link7) (hasangle angle330 link8) (hasangle angle60 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   added: (hasangle angle210 link4) (hasangle angle270 link5) (hasangle angle240 link6) (hasangle angle60 link7) (hasangle angle0 link8) (hasangle angle90 link9) (hasangle angle300 link10) (hasangle angle180 link11)
   goals met: 5 of 11
45. (decrease_angle link6 angle240 angle210)
   deleted: (hasangle angle240 link6) (hasangle angle60 link7) (hasangle angle0 link8) (hasangle angle90 link9) (hasangle angle300 link10) (hasangle angle180 link11)
   added: (hasangle angle210 link6) (hasangle angle30 link7) (hasangle angle330 link8) (hasangle angle60 link9) (hasangle angle270 link10) (hasangle angle150 link11)
   goals met: 11 of 11
